/************************************************************************
串操作的库函数
************************************************************************/
#pragma once

#include <string>
#include <windows.h>  //这个头文件必须添加
#include <iomanip>
#include <fstream>

using namespace std;

/************************************************************************
//函数名：wstring_to_string
//参数：wstring
//返回类型：string
//Function：wstring->string不同字符集类型转化
************************************************************************/
string wstring_to_string(wstring wstr);

/************************************************************************
//函数名：string_to_wstring
//参数：string
//返回类型：wstring
//Function：string->wstring不同字符集类型转化
************************************************************************/
wstring string_to_wstring(string str);

/************************************************************************
//函数名：pwchart_to_pchar
//参数：wchar_t*
//返回类型：char*
//Function：wchar_t* ->char* 类型转化
************************************************************************/
char* pwchart_to_pchar(wchar_t* pwcstr);